<template>
	<div class="uk-container">
		<ul uk-tab>
			<li class="uk-disabled">{{ year }}</li>
			<li v-for="i in 12" v-bind:key="i" v-bind:class="{'uk-active': i === month}"><a href="#">{{ i }}</a></li>
		</ul>
		<ul class="uk-switcher">
			<!-- なぜかuk-activeを付けないと初期表示されない -->
			<li v-for="m in 12" v-bind:key="m" v-bind:class="{'uk-active': month === m}">
				<table class="uk-table uk-table-justify uk-table-small uk-table-divider">
					<tbody>
						<tr v-for="d in new Date(year, m, 0).getDate()" v-bind:key="d" v-bind:class="{today: year === new Date().getFullYear() && m === new Date().getMonth() + 1 && d === new Date().getDate()}">
							<td>{{ d }} ({{ day[new Date(year, m - 1, d).getDay()] }})</td>
							<td>{{ message[m + '-' + d] }}</td>
						</tr>
					</tbody>
				</table>
			</li>
		</ul>
	</div>
</template>
<script>
export default {
	data: function() {
		return {
			year: new Date().getFullYear(),
			month: new Date().getMonth() + 1,
			day: ['日', '月', '火', '水', '木', '金', '土'],
			message: {
				'1-1': 'デイビット・ラブの誕生日',
				'1-2': '遊☆戯☆王デュエルモンスターズ 光のピラミッド テレビ放送 (2005)',
				'1-11': 'ジャック・アトラスの誕生日',
				'1-23': '10thアニバーサリー 劇場版 遊☆戯☆王 ~超融合!時空を越えた絆~ 公開日 (2010)',
				'1-25': '城之内 克也の誕生日',
				'2-5': 'アモン・ガラムの誕生日',
				'2-28': '御伽 龍児の誕生日',
				'3-1': '梶木 漁太の誕生日',
				'3-6': '劇場版「遊☆戯☆王」 公開日 (1999)',
				'3-8': '遊☆戯☆王 連載終了 (2004)',
				'3-14': 'ジェームス(ジム)・クロコダイル・クックの誕生日',
				'3-23': '遊☆戯☆王ZEXAL 放送終了 (2014)',
				'3-26': '遊☆戯☆王デュエルモンスターズGX 放送終了 (2008) / 遊☆戯☆王ARC-V 放送終了 (2017)',
				'3-29': 'オースチン・オブライエンの誕生日',
				'3-30': "遊☆戯☆王5D's 放送終了 (2011)",
				'4-1': 'エスパー絽場の誕生日 / 龍牙 の誕生日',
				'4-2': "遊☆戯☆王5D's 放送開始 (2008)",
				'4-4': '遊☆戯☆王 (アニメ第1作) 放送開始 (1998) / 遊☆戯☆王SEVENS 放送開始 (2020)',
				'4-5': 'イシズ・イシュタールの誕生日',
				'4-6': '遊☆戯☆王ARC-V 放送開始 (2014)',
				'4-11': '遊☆戯☆王ZEXAL 放送開始 (2011)',
				'4-12': '三沢 大地の誕生日',
				'4-18': '遊☆戯☆王デュエルモンスターズ 放送開始 (2000)',
				'4-20': '本田 ヒロトの誕生日',
				'4-23': '遊☆戯☆王 THE DARK SIDE OF DIMENSIONS 公開日 (2016)',
				'5-5': '天上院 明日香の誕生日',
				'5-10': '遊☆戯☆王VRAINS 放送開始 (2017)',
				'6-4': '武藤 遊戯の誕生日 / 伊集院 セクトの誕生日',
				'6-6': 'ゴースト骨塚の誕生日',
				'6-11': 'ヨハン・アンデルセンの誕生日',
				'6-20': '龍亞の誕生日, 龍可の誕生日',
				'6-21': 'エビフライの日',
				'7-7': '不動 遊星の誕生日 / 海馬 モクバの誕生日',
				'7-10': '響 みどりの誕生日',
				'7-21': 'インセクター羽蛾の誕生日',
				'8-1': '万丈目 準の誕生日',
				'8-12': 'キース・ハワードの誕生日',
				'8-13': '遊☆戯☆王デュエルモンスターズ 光のピラミッド 公開日 (2004)',
				'8-16': '十六夜 アキの誕生日',
				'8-18': '真崎 杏子の誕生日',
				'8-21': 'レクス・コドウィンの誕生日',
				'8-31': '遊城 十代の誕生日',
				'9-2': '獏良 了の誕生日',
				'9-6': 'クロウ・ホーガンの誕生日',
				'9-16': '遊☆戯☆王 連載開始 (1996)',
				'9-25': '丸藤 翔の誕生日 / 遊☆戯☆王VRAINS 放送終了 (2019)',
				'9-29': '遊☆戯☆王デュエルモンスターズ 放送終了 (2004)',
				'10-4': '武藤 双六の誕生日',
				'10-6': '遊☆戯☆王デュエルモンスターズGX 放送開始 (2004)',
				'10-8': 'ペガサス・J・クロフォードの誕生日',
				'10-10': 'レジー・マッケンジーの誕生日 / 遊☆戯☆王 (アニメ第1作) 放送終了 (1998)',
				'10-25': '海馬 瀬人の誕生日',
				'10-31': '天上院 吹雪の誕生日',
				'11-1': '丸藤 亮の誕生日 / 鬼柳 京介の誕生日',
				'11-4': '響 紅葉の誕生日',
				'11-18': 'リシドの誕生日',
				'11-20': '孔雀 舞の誕生日',
				'12-14': '骸骨騎士の誕生日',
				'12-19': 'エド・フェニックスの誕生日',
				'12-23': 'マリク・イシュタールの誕生日',
				'12-29': 'ダイナソー竜崎の誕生日'
			}
		};
	}
}
</script>
